class CreatePosts < ActiveRecord::Migration
  class User < ActiveRecord::Base
  end
  class Post < ActiveRecord::Base
    belongs_to :author, class_name: 'User'
  end

  def change
    create_table :posts do |t|
      t.string :title
      t.text :body
      t.references :author, index: true, foreign_key: true

      t.timestamps null: false
    end

    User.reset_column_information
    Post.reset_column_information

    titles = [
      'Комітет ВР просить Прокуратуру і Порошенка відреагувати на поведінку Коломойського',
      'Киянам повернули будинок художників на Андріївському узвозі',
      'За добу в зоні АТО поранення дістали 3 бійця - штаб',
      '"Нафтогаз" перерахував "Газпрому" ще 15 мільйонів доларів ',
      'МЗС пропонує відкликати з Білорусі екс-міністра оборони при Януковичі',
      'В МЗС жартують: Міняю санкції на Крим з доплатою',
      'Bloomberg: виробник антивірусів Касперський працює в інтересах ФСБ',
      'Південно-Західна залізниця відмовляється виконувати накази Укрзалізниці',
      'Єфремов покірно носить браслет і чекає рішення суду - адвокат',
      'Депутати вимагають вибачень Коломойського перед журналістом і відставки',
    ]

    bodies = [
      'Спалили авто організації "Східний корпус"',
      'Через Кисельова Росія погрожує Кишиневу: Молдова йде шляхом України',
      'Лідери країн ЄС домовилися створювати Енергетичний союз',
      'Міст через Сіверський Донець у Станиці Луганській зруйновано',
      'Вартість нафти Brent зростає через ослаблення долара',
      'Бойовики знову задіяли нібито "відведену" техніку, за ніч – 15 обстрілів',
      'Коломойського треба зняти з посади губернатора - депутат Найєм',
      'Економічні санкції зберігатимуться до повного виконання мінських угод - Туск',
      'Міліція взяла під охорону "Уктранснафту" - Аваков',
      'Коломойський обматюкав журналіста і заявив про російських диверсантів',
    ]

    users = User.all

    titles.zip(bodies).each do |title, body|
      Post.create!(author: users.sample, title: title, body: body)
    end
  end
end
